Satoshi5385/CloudBaseVario/sdkconfig.defaults
# CloudBaseVario baseline for ESP32-S3-WROOM-1-N16R8.
CONFIG_IDF_TARGET="esp32s3"

# 16 MB Quad SPI flash and 8 MB Octal PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# Standard dual-core ESP-IDF FreeRTOS, 1 ms tick. The experimental Amazon SMP
# kernel and unicore mode both remain disabled.
# CONFIG_FREERTOS_SMP is not set
# CONFIG_FREERTOS_UNICORE is not set
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=8

# app_power configures 40/80 MHz DFS explicitly. Automatic light sleep is held
# off during normal operation and released only after a complete safe stop.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=80
CONFIG_PM_ENABLE=y
# CONFIG_PM_DFS_INIT_AUTO is not set
CONFIG_PM_SLEEP_FUNC_IN_IRAM=y
CONFIG_PM_LIGHT_SLEEP_CALLBACKS=y
# CONFIG_PM_PROFILING is not set
# CONFIG_PM_TRACE is not set

# BLE-only controller with NimBLE Host. Wi-Fi and Bluedroid are not used.
CONFIG_BT_ENABLED=y
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_GATT_SERVER=y
# CONFIG_BT_NIMBLE_SECURITY_ENABLE is not set
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_CCCDS=1
CONFIG_BT_NIMBLE_WHITELIST_SIZE=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=23
CONFIG_BT_NIMBLE_ATT_MAX_PREP_ENTRIES=1
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=1
# CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT is not set
# CONFIG_BT_NIMBLE_HS_PVCY is not set
# CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT is not set
# CONFIG_BT_NIMBLE_PROX_SERVICE is not set
# CONFIG_BT_NIMBLE_ANS_SERVICE is not set
# CONFIG_BT_NIMBLE_CTS_SERVICE is not set
# CONFIG_BT_NIMBLE_HTP_SERVICE is not set
# CONFIG_BT_NIMBLE_IPSS_SERVICE is not set
# CONFIG_BT_NIMBLE_TPS_SERVICE is not set
# CONFIG_BT_NIMBLE_IAS_SERVICE is not set
# CONFIG_BT_NIMBLE_LLS_SERVICE is not set
# CONFIG_BT_NIMBLE_SPS_SERVICE is not set
# CONFIG_BT_NIMBLE_HR_SERVICE is not set
# CONFIG_BT_NIMBLE_BAS_SERVICE is not set
# CONFIG_BT_NIMBLE_DIS_SERVICE is not set
# CONFIG_BT_NIMBLE_DTM_MODE_TEST is not set
# CONFIG_BT_NIMBLE_SM_SIGN_CNT is not set
# CONFIG_BT_NIMBLE_CPFD_CAFD is not set
# CONFIG_BT_NIMBLE_RECONFIG_MTU is not set
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
CONFIG_BT_NIMBLE_LOG_LEVEL=2
# CONFIG_BT_NIMBLE_PRINT_ERR_NAME is not set
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="CloudBaseVario"
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y
CONFIG_BT_CTRL_LPCLK_SEL_MAIN_XTAL=y
# CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP is not set
# CONFIG_ESP_COEX_SW_COEXIST_ENABLE is not set
# ESP-IDF keeps its hidden ESP_WIFI_ENABLED capability selected on ESP32-S3.
# The application intentionally does not initialize or use the Wi-Fi stack.

# Final USB configuration: TinyUSB provides CDC and MSC on the USB OTG
# peripheral. Application stdio is redirected after TinyUSB is initialized.
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_USB_CDC is not set
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_USJ_ENABLE_USB_SERIAL_JTAG is not set
CONFIG_WL_SECTOR_SIZE_512=y
# CONFIG_WL_SECTOR_MODE_PERF is not set
CONFIG_WL_SECTOR_MODE_SAFE=y
CONFIG_FATFS_USE_LABEL=y

CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_CDC_RX_BUFSIZE=512
CONFIG_TINYUSB_CDC_TX_BUFSIZE=4096
CONFIG_TINYUSB_CDC_EP_BUFSIZE=512
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=8192
CONFIG_TINYUSB_MSC_MOUNT_PATH="/config"
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=y
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=y
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="CloudBaseVario"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="CloudBaseVario CDC+MSC"
CONFIG_TINYUSB_DESC_CDC_STRING="CloudBaseVario Console"
CONFIG_TINYUSB_DESC_MSC_STRING="CloudBaseVario Storage"
CONFIG_TINYUSB_DFU_MODE_NONE=y

# Factory plus two application OTA slots with rollback support.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Sensor recovery policy from SW_spec.md.
CONFIG_CBV_SENSOR_RETRY_INTERVAL_MS=2000
CONFIG_CBV_SENSOR_CONSECUTIVE_ERROR_LIMIT=10
CONFIG_CBV_IMU_HXY_ENABLE=y
